import { Component, OnInit } from '@angular/core';
const ROOM_NAMES = {
  'спортзал': ['1_K2', '1_K4'],
  'прачку': ['2_Q6'],
  'лестницу': ['3_Q1'],
  'котельную': ['3_Q2'],
  'терассу': ['3_Q7'],
  'столовую': ['4_Q1', '4_Q2'],
  'кухня': ['4_Q3', '4_Q4'],
  'гостинную': ['4_Q5', '4_Q6', '4_Q7', '4_Q8'],
  'стол': ['4_Q2'],
  'люстру': ['4_Q6'],
  'бра телевизор': ['4_Q7'],
  'бра диван': ['4_Q8'],
  'коридор': ['5_Q1', '5_Q2'],
  'прихожую': ['5_Q4'],
  'гардероб': ['5_Q6'],
  'переход': ['5_Q8'],
  'кабинет': ['6_Q5'],
  'тамбур гараж': ['6_Q8'],
  'гараж': ['7_Q1', '7_Q2'],
  'никита': ['7_Q6'],
  'игровая': ['8_Q3'],
  'маша': ['8_Q5'],
  'варя': ['9_Q1', '9_Q4'],
  'игровая люстра': ['9_Q5'],
  'спальня телевизор': ['10_Q3'],
  'дом': ['10_Q6'],
  'дорожки': ['10_Q7'],
  'баня': ['10_Q8']
};
@Component({
  selector: 'app-rules',
  templateUrl: './rules.component.html',
  styleUrls: ['./rules.component.less']
})
export class RulesComponent implements OnInit {
  rooms: string[] = [];
  prefix = ['включи/включить', 'выключи/выключить'];

  constructor() {
    this.rooms = Object.keys(ROOM_NAMES);
  }

  ngOnInit() {

  }

}
